// Copyright (c) 2011 The Chromium OS Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

/* Error starting Disk Arbitration. */
"NoDiskArb Message" = "Nie można uruchomić tej aplikacji.";
"NoDiskArb Informative" = "Wystąpił problem przy uruchamianiu narzędzia Disk Arbitration. Taka sytuacja nie powinna mieć miejsca.";
"NoDiskArb OK" = "OK";

/* Error retrieving config file. */
"CantGetConfig Message" = "Nie można pobrać listy obrazów.";
"CantGetConfig Informative" = "Wystąpił problem przy pobieraniu listy dostępnych obrazów odzyskiwania (%1$@). Upewnij się, że działa połączenie sieciowe.";
"CantGetConfig OK" = "OK";
"CantGetConfig Error NoConnection" = "nie można przydzielić połączenia";
"CantGetConfig Error DownloadError" = "wystąpił błąd podczas pobierania";
"CantGetConfig Error StringCreate" = "nie można użyć odpowiedzi";

/* Version error. */
"VersionError Message" = "Ta wersja aplikacji jest zbyt stara.";
"VersionError Informative" = "Pobierz nowszą wersję. To jest wersja %1$@, a wymagana jest co najmniej wersja %2$@. %3$@";
"VersionError OK" = "Pobierz nową wersję";

/* File dialog to select a local file. */
"SelectLocal File" = "Wybierz obraz:";
"SelectLocal Button" = "Wybierz";

/* Alert on writing stick. */
"WriteAlert Message" = "Czy na pewno trwale wyczyścić urządzenie %1$@?";
"WriteAlert Informative" = "Wszystkie aktualnie zapisane na nim dane zostaną trwale utracone. Tej operacji nie można cofnąć.";
"WriteAlert Cancel" = "Nie usuwaj";
"WriteAlert OK" = "Usuń";

"TooSmallAlert Message" = "Nie można użyć urządzenia %1$@, ponieważ ma ono zbyt małą pojemność.";
"TooSmallAlert Informative" = "Wymagane jest urządzenie o pojemności co najmniej %2$@.";
"TooSmallAlert OK" = "OK";

"NotWritable Message" = "Nie można użyć urządzenia %1$@, ponieważ jest ono przeznaczone tylko do odczytu.";
"NotWritable Informative" = "To urządzenie jest przeznaczone tylko do odczytu. Możliwe, że urządzenie jest wyposażone w przełącznik umożliwiający dokonywanie zapisu. W przeciwnym razie to urządzenie nie może zostać użyte.";
"NotWritable OK" = "OK";

/* Stick writing statuses. */
"Status Downloading" = "Pobieranie…";
"Status Verifying" = "Weryfikowanie…";
"Status Unpacking" = "Rozpakowywanie…";
"Status Claiming" = "Rezerwowanie…";
"Status Unmounting" = "Odłączanie…";
"Status Writing" = "Zapisywanie…";
"Status Ejecting" = "Wysuwanie…";
"Status Done" = "Gotowe";

"StatusAdd Attempt" = " (próba: %1$d)";

/* Errors */
"Failure Downloading" = "Niestety, wystąpił błąd (nie udało się pobrać obrazu źródłowego). Czy chcesz spróbować ponownie?";
"Failure Verifying Return Value" = "Niestety, wystąpił błąd (nie udało się zweryfikować obrazu źródłowego: niepowodzenie programu, %1$s). Czy chcesz spróbować ponownie?";
"Failure Verifying SHA Mismatch" = "Niestety, wystąpił błąd (nie udało się zweryfikować obrazu źródłowego: błąd sumy kontrolnej). Czy chcesz spróbować ponownie?";
"Failure Unpacking" = "Niestety, wystąpił błąd (nie udało się rozpakować obrazu źródłowego, %1$s). Czy chcesz spróbować ponownie?";
"Failure Claiming" = "Niestety, wystąpił błąd (nie udało się zarezerwować urządzenia USB). Czy chcesz spróbować ponownie?";
"Failure Unmounting" = "Niestety, wystąpił błąd (nie udało się odłączyć urządzenia USB). Czy chcesz spróbować ponownie?";
"Failure Opening Source Image" = "Niestety, wystąpił błąd (nie udało się otworzyć obrazu źródłowego, %1$s). Czy chcesz spróbować ponownie?";
"Failure Opening Destination Device" = "Niestety, wystąpił błąd (nie udało się otworzyć urządzenia USB, %1$s). Czy chcesz spróbować ponownie?";
"Failure Reading Source Image" = "Niestety, wystąpił błąd (nie udało się odczytać obrazu źródłowego, %1$s). Czy chcesz spróbować ponownie?";
"Failure Writing Destination Device" = "Niestety, wystąpił błąd (nie udało się zapisać danych na urządzeniu USB, %1$s). Czy chcesz spróbować ponownie?";
"Failure Ejecting" = "Niestety, wystąpił błąd (nie udało się wysunąć urządzenia USB). Czy chcesz spróbować ponownie?";

"Failure Try Again" = "Spróbuj ponownie";
"Failure Quit" = "Zamknij";

"Failure Termination Status" = "Stan zakończenia: %d";

"Failure Internal Error 1" = "Nieoczekiwany koniec pliku";
